In [1]:
%reload_ext autoreload
%autoreload 2

In [2]:
from fastai import *
from fastai.tabular import *
import pandas as pd

In [3]:
data_path = "data\\genpact"

In [4]:
df = pd.read_csv(data_path+'\\train.csv')

In [5]:
df.head().T

,0,1,2,3,4
id,1379560.00,1466964.00,1346989.00,1338232.00,1448490.0
week,1.00,1.00,1.00,1.00,1.0
center_id,55.00,55.00,55.00,55.00,55.0
meal_id,1885.00,1993.00,2539.00,2139.00,2631.0
checkout_price,136.83,136.83,134.86,339.50,243.5
base_price,152.29,135.83,135.86,437.53,242.5
emailer_for_promotion,0.00,0.00,0.00,0.00,0.0
homepage_featured,0.00,0.00,0.00,0.00,0.0
num_orders,177.00,270.00,189.00,54.00,40.0

In [6]:
center_df = pd.read_csv(data_path+'\\center_info.csv')

In [7]:
center_df.head().T

                  0       1       2       3       4
center_id        11      13     124      66      94
city_code       679     590     590     648     632
region_code      56      56      56      34      34
center_type  TYPE_A  TYPE_B  TYPE_C  TYPE_A  TYPE_C
op_area         3.7     6.7       4     4.1     3.6

In [ ]:
meal_df = pd.read_csv(data_path+'\\meal_info.csv')

In [ ]:
meal_df.head().T

                  0          1          2          3          4
meal_id        1885       1993       2539       1248       2631
category  Beverages  Beverages  Beverages  Beverages  Beverages
cuisine        Thai       Thai       Thai     Indian     Indian

In [ ]:
len(df)

456548

In [ ]:
combine_center_and_df = pd.merge(df,center_df,on='center_id',how='outer')

In [ ]:
combine_center_and_df.head().T

                             0        1        2        3        4
id                     1379560  1466964  1346989  1338232  1448490
week                         1        1        1        1        1
center_id                   55       55       55       55       55
meal_id                   1885     1993     2539     2139     2631
checkout_price          136.83   136.83   134.86    339.5    243.5
base_price              152.29   135.83   135.86   437.53    242.5
emailer_for_promotion        0        0        0        0        0
homepage_featured            0        0        0        0        0
num_orders                 177      270      189       54       40
city_code                  647      647      647      647      647
region_code                 56       56       56       56       56
center_type             TYPE_C   TYPE_C   TYPE_C   TYPE_C   TYPE_C
op_area                      2        2        2        2        2

In [ ]:
final_df = pd.merge(combine_center_and_df,meal_df,on='meal_id',how='outer')

In [ ]:
final_df.head().T

                               0          1          2          3          4
id                       1379560    1018704    1196273    1116527    1343872
week                           1          2          3          4          5
center_id                     55         55         55         55         55
meal_id                     1885       1885       1885       1885       1885
checkout_price            136.83     135.83     132.92     135.86      146.5
base_price                152.29     152.29     133.92     134.86      147.5
emailer_for_promotion          0          0          0          0          0
homepage_featured              0          0          0          0          0
num_orders                   177        323         96        163        215
city_code                    647        647        647        647        647
region_code                   56         56         56         56         56
center_type               TYPE_C     TYPE_C     TYPE_C     TYPE_C     TYPE_C
op_area                        2          2          2          2          2
category               Beverages  Beverages  Beverages  Beverages  Beverages
cuisine                     Thai       Thai       Thai       Thai       Thai

In [ ]:
test_df = pd.read_csv(data_path+'\\test.csv')

In [ ]:
test_df.head()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured
0,1028232,146,55,1885,158.11,159.11,0,0
1,1127204,146,55,1993,160.11,159.11,0,0
2,1212707,146,55,2539,157.14,159.14,0,0
3,1082698,146,55,2631,162.02,162.02,0,0
4,1400926,146,55,1248,163.93,163.93,0,0

In [ ]:
combine_test_one = pd.merge(test_df,center_df,on='center_id',how='outer')

In [ ]:
final_test = pd.merge(combine_test_one,meal_df,on='meal_id',how='outer')

In [ ]:
final_test.head().T

                               0          1          2          3          4
id                       1028232    1262649    1453211    1262599    1495848
week                         146        147        149        150        151
center_id                     55         55         55         55         55
meal_id                     1885       1885       1885       1885       1885
checkout_price            158.11     159.11     157.14     159.14     160.11
base_price                159.11     159.11     158.14     157.14     159.11
emailer_for_promotion          0          0          0          0          0
homepage_featured              0          0          0          0          0
city_code                    647        647        647        647        647
region_code                   56         56         56         56         56
center_type               TYPE_C     TYPE_C     TYPE_C     TYPE_C     TYPE_C
op_area                        2          2          2          2          2
category               Beverages  Beverages  Beverages  Beverages  Beverages
cuisine                     Thai       Thai       Thai       Thai       Thai

In [ ]:
len(final_df),len(final_test)

(456548, 32573)

In [ ]:
procs=[FillMissing, Categorify, Normalize]

In [ ]:
cat_vars = ['week','center_id','meal_id','emailer_for_promotion','homepage_featured',
            'city_code','region_code','center_type','op_area','category','cuisine']

In [ ]:
cont_vars = ['checkout_price','base_price']

In [ ]:
dep_var = 'num_orders'

In [ ]:
valid_cut = 35000

In [ ]:
df = final_df[cat_vars + cont_vars + [dep_var]].copy()

In [ ]:
valid_idx = range(valid_cut)

In [ ]:
df[dep_var].head()

0    177
1    323
2     96
3    163
4    215
Name: num_orders, dtype: int64

In [ ]:
data = (TabularList.from_df(df, path=data_path, cat_names=cat_vars, cont_names=cont_vars, procs=procs)
                   .split_by_idx(valid_idx)
                   .label_from_df(cols=dep_var, label_cls=FloatList, log=True)
                   .databunch())

In [ ]:
max_log_y = np.log(np.max(final_df['num_orders'])*1.2)

In [ ]:
y_range = torch.tensor([0, max_log_y], device=defaults.device)

In [ ]:
torch.cuda.is_available()

True

In [ ]:
learn = tabular_learner(data, layers=[1000,500], ps=[0.001,0.01], emb_drop=0.04, 
                        y_range=y_range, metrics=exp_rmspe)

In [ ]:
learn.model

TabularModel(
  (embeds): ModuleList(
    (0): Embedding(146, 26)
    (1): Embedding(78, 18)
    (2): Embedding(49, 14)
    (3): Embedding(3, 3)
    (4): Embedding(3, 3)
    (5): Embedding(52, 15)
    (6): Embedding(9, 5)
    (7): Embedding(4, 3)
    (8): Embedding(31, 11)
    (9): Embedding(15, 7)
    (10): Embedding(5, 4)
  )
  (emb_drop): Dropout(p=0.04)
  (bn_cont): BatchNorm1d(2, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (layers): Sequential(
    (0): Linear(in_features=111, out_features=1000, bias=True)
    (1): ReLU(inplace)
    (2): BatchNorm1d(1000, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (3): Dropout(p=0.001)
    (4): Linear(in_features=1000, out_features=500, bias=True)
    (5): ReLU(inplace)
    (6): BatchNorm1d(500, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (7): Dropout(p=0.01)
    (8): Linear(in_features=500, out_features=1, bias=True)
  )
)

In [ ]:
data.train_ds.cat_names

['week',
 'center_id',
 'meal_id',
 'emailer_for_promotion',
 'homepage_featured',
 'city_code',
 'region_code',
 'center_type',
 'op_area',
 'category',
 'cuisine']

In [ ]:
data.show_batch(rows=10)